<a href="https://colab.research.google.com/github/ashkanmulla/Ashkan_Data_Science_Practice/blob/main/Pandas_Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Series object in pandas

In [ ]:
import pandas as pd

In [ ]:
data = [1,2,3,4,]

In [ ]:
series1 = pd.Series(data)

In [ ]:
series1

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
type(series1)

pandas.core.series.Series

In [ ]:
#Changing the index of a series object

In [ ]:
series1 = pd.Series(data, index = ["a", "b", "c,", "d"])
series1

a     1
b     2
c,    3
d     4
dtype: int64

In [ ]:
#Creating a data frame using a list

In [ ]:
import pandas as pd

In [ ]:
data = [1,2,3,4]

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

   0
0  1
1  2
2  3
3  4

In [ ]:
#Creating a dataframe using a dictionary

In [ ]:
dictionary = {"Fruits" :["apple", "banana", "mangos"], "Count":[10,20,15]}

In [ ]:
df = pd.DataFrame(dictionary)

In [ ]:
df

   Fruits  Count
0   apple     10
1  banana     20
2  mangos     15

In [ ]:
#Creating a dataframe using a series

In [ ]:
series = pd.Series([6,12], index = ["a", "b"])
df = pd.DataFrame(series)

In [ ]:
df

    0
a   6
b  12

In [ ]:
#Creating a dataframe using a numpy array

In [ ]:
import numpy as np

In [ ]:
numpyarray = np.array([[50000,60000], ["Ashkan", "Mehjabeen"]])

In [ ]:
df = pd.DataFrame({"name": numpyarray[1], "salary": numpyarray[0]})

In [ ]:
df

        name salary
0     Ashkan  50000
1  Mehjabeen  60000